task> taski 10
Task manager is initialized (10)

task> taskn -r 1
Task node inserted: (vkuuxf, 6704)
... 1 new task nodes are added.

task> taskn -n abcde 100
Task node inserted: (abcde, 100)

task> taskn -n qqqqq 8000
Task node inserted: (qqqqq, 8000)

task> taskn -n xxxxx 4000
Task node inserted: (xxxxx, 4000)

task> taskn -n xxxxx 3000
Task node inserted: (xxxxx, 3000)
Error: Task node (xxxxx) already exists.

task> taskn -n bbbbb 5000
Task node inserted: (bbbbb, 5000)

task> taskq -hash
(vkuuxf, 6704)
(xxxxx, 4000)
(abcde, 100)
(bbbbb, 5000)
(qqqqq, 8000)
Number of tasks: 5

task> taskq -min
Min task node: (vkuuxf, 6704)

task> taska 1234 -r 4
Task assignment succeeds...
Updating min: (abcde, 100)
Task assignment succeeds...
Updating min: (abcde, 1334)
Task assignment succeeds...
Updating min: (xxxxx, 4000)
Task assignment succeeds...
Updating min: (abcde, 2568)

task> taskq -heap
(abcde, 2568)
(bbbbb, 5000)
(vkuuxf, 7938)
(xxxxx, 5234)
(bbbbb, 5000)
(qqqqq, 8000)
(vkuuxf, 7938)
(qqqqq, 8000)
(qqqqq, 8000)
Number of tasks: 9

task> taska 4321 -r 3
Task assignment succeeds...
Updating min: (bbbbb, 5000)
Task assignment succeeds...
Updating min: (bbbbb, 5000)
Task assignment succeeds...
Updating min: (xxxxx, 5234)

task> taskq -min
Min task node: (xxxxx, 5234)

task> q -f

