adt> adta -r 20

adt> adtp
=== ADT (array) ===
[  0] = vkuux   [  1] = agdue   [  2] = jvxby   [  3] = ncerx   
[  4] = ykvrx   [  5] = mfyxd   [  6] = wqlqh   [  7] = uhlfe   
[  8] = tvywv   [  9] = ztxzr   [ 10] = mevxc   [ 11] = qgqfs   
[ 12] = iigbq   [ 13] = fqnzh   [ 14] = oscmp   [ 15] = yliwl   
[ 16] = blurl   [ 17] = dppnp   [ 18] = jhxme   [ 19] = pnqpg   


adt> adtd -front 3

adt> adtp
=== ADT (array) ===
[  0] = dppnp   [  1] = agdue   [  2] = jvxby   [  3] = ncerx   
[  4] = ykvrx   [  5] = mfyxd   [  6] = wqlqh   [  7] = uhlfe   
[  8] = tvywv   [  9] = ztxzr   [ 10] = mevxc   [ 11] = qgqfs   
[ 12] = iigbq   [ 13] = fqnzh   [ 14] = oscmp   [ 15] = yliwl   
[ 16] = blurl   

adt> adtd -back 5

adt> adtp
=== ADT (array) ===
[  0] = dppnp   [  1] = agdue   [  2] = jvxby   [  3] = ncerx   
[  4] = ykvrx   [  5] = mfyxd   [  6] = wqlqh   [  7] = uhlfe   
[  8] = tvywv   [  9] = ztxzr   [ 10] = mevxc   [ 11] = qgqfs   


adt> adtd -rand 4

adt> adtp
=== ADT (array) ===
[  0] = qgqfs   [  1] = agdue   [  2] = jvxby   [  3] = ncerx   
[  4] = ykvrx   [  5] = mfyxd   [  6] = wqlqh   [  7] = uhlfe   


adt> q -f

